Tekla.Structures.Geometry3d.PolycurveConversions
The Tekla.Structures.Geometry3d.PolycurveConversions class converts structures representing polycurves
from Tekla.Structures.Geometry3d to Tekla.BIM.DirectManipulation.Geometry and back.

Tekla.Structures.Geometry3d.PolycurveConversions.ToComplexGeometry(Tekla.Structures.Geometry3d.Polycurve)
Converts a Tekla.Structures.Geometry3d.Polycurve to a Tekla.BIM.DirectManipulation.Geometry.IComplexGeometry.
polycurve: The Tekla.Structures.Geometry3d.Polycurve to convert.
Returns: The resulting Tekla.BIM.DirectManipulation.Geometry.ComplexGeometry.

Tekla.Structures.Geometry3d.PolycurveConversions.ToPolycurve(Tekla.BIM.DirectManipulation.Geometry.IComplexGeometry)
Converts a Tekla.BIM.DirectManipulation.Geometry.IComplexGeometry to a Tekla.Structures.Geometry3d.Polycurve.
complexGeometry: The Tekla.BIM.DirectManipulation.Geometry.IComplexGeometry to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Polycurve.